Autodesk.Revit.UI.Events.FabricationPartBrowserOperation
Operations for the FabricationPartBrowserChangedEventArgs Event

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.SwitchToInlineFittingsTab
Make the inline fittings tab active in Change Service.

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.FinishSizeSwapOutMode
Finish size swap out mode.

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.StartSizeSwapOutMode
Start size swap-out mode.

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.UpdateServiceSwapOutSizes
Service swap out size mappings has changed.

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.UpdateServiceSwapOutPartTypes
Service swap out part type mappings has changed.

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.FinishServiceSwapOutMode
Finish service swap-out mode

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.StartServiceSwapOutMode
Start service swap-out mode

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.FinishMPRoutingMode
Finish multi-point routing mode

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.StartMPRoutingMode
Start multi-point routing mode

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.FinishRoutingSolutionMode
Finish routing solution mode

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.RoutingSolutionChanged
Active Routing solution has changed

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.CreatedRoutingSolutions
Routing solutions (re)created

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.StartRoutingSolutionMode
Start routing solution mode

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.ShowService
Select current service

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.HideBrowser
Hide browser window

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.ShowBrowser
Show browser window

Autodesk.Revit.UI.Events.FabricationPartBrowserOperation.UnknownOperation
Unknown operation